; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	infrared1 - mode
	image0 - mode
	infrared3 - mode
	thermograph2 - mode
	Star0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star8 - direction
	Star12 - direction
	Star17 - direction
	Star19 - direction
	GroundStation23 - direction
	GroundStation24 - direction
	GroundStation16 - direction
	GroundStation7 - direction
	Star21 - direction
	Star13 - direction
	GroundStation18 - direction
	Star5 - direction
	Star22 - direction
	Star11 - direction
	GroundStation9 - direction
	Star14 - direction
	Star6 - direction
	Star3 - direction
	Star15 - direction
	GroundStation10 - direction
	Star20 - direction
	Phenomenon25 - direction
	Star26 - direction
	Planet27 - direction
	Star28 - direction
	Phenomenon29 - direction
	Planet30 - direction
	Phenomenon31 - direction
	Phenomenon32 - direction
	Planet33 - direction
	Phenomenon34 - direction
	Planet35 - direction
	Planet36 - direction
	Star37 - direction
	Phenomenon38 - direction
	Star39 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation16)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 GroundStation18)
	(supports instrument1 infrared1)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star21)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star13)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star39)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star22)
	(calibration_target instrument2 Star14)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star21)
	(supports instrument3 image0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star22)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation18)
	(calibration_target instrument3 Star13)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet35)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star20)
	(calibration_target instrument4 GroundStation10)
	(calibration_target instrument4 Star15)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star14)
	(calibration_target instrument4 GroundStation9)
	(calibration_target instrument4 Star11)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation24)
)
(:goal (and
	(pointing satellite2 Star28)
	(have_image Phenomenon25 infrared3)
	(have_image Star26 infrared3)
	(have_image Planet27 infrared1)
	(have_image Star28 infrared3)
	(have_image Phenomenon29 infrared3)
	(have_image Planet30 thermograph2)
	(have_image Phenomenon31 thermograph2)
	(have_image Phenomenon32 image0)
	(have_image Planet33 infrared3)
	(have_image Phenomenon34 infrared3)
	(have_image Planet35 infrared3)
	(have_image Planet36 image0)
	(have_image Star37 thermograph2)
	(have_image Phenomenon38 infrared3)
	(have_image Star39 infrared3)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 16
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 16
3. (turn_to satellite2 star28 groundstation24)
   deleted: (pointing satellite2 groundstation24)
   added: (pointing satellite2 star28)
   goals met: 1 of 16
4. (turn_to satellite1 phenomenon32 planet35)
   deleted: (pointing satellite1 planet35)
   added: (pointing satellite1 phenomenon32)
   goals met: 1 of 16
5. (turn_to satellite0 star21 star39)
   deleted: (pointing satellite0 star39)
   added: (pointing satellite0 star21)
   goals met: 1 of 16
6. (calibrate satellite0 instrument1 star21)
   added: (calibrated instrument1)
   goals met: 1 of 16
7. (turn_to satellite0 phenomenon25 star21)
   deleted: (pointing satellite0 star21)
   added: (pointing satellite0 phenomenon25)
   goals met: 1 of 16
8. (take_image satellite0 phenomenon25 instrument1 infrared3)
   added: (have_image phenomenon25 infrared3)
   goals met: 2 of 16
9. (turn_to satellite0 phenomenon29 phenomenon25)
   deleted: (pointing satellite0 phenomenon25)
   added: (pointing satellite0 phenomenon29)
   goals met: 2 of 16
10. (take_image satellite0 phenomenon29 instrument1 infrared3)
   added: (have_image phenomenon29 infrared3)
   goals met: 3 of 16
11. (turn_to satellite0 phenomenon31 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 phenomenon31)
   goals met: 3 of 16
12. (take_image satellite0 phenomenon31 instrument1 thermograph2)
   added: (have_image phenomenon31 thermograph2)
   goals met: 4 of 16
13. (turn_to satellite0 phenomenon34 phenomenon31)
   deleted: (pointing satellite0 phenomenon31)
   added: (pointing satellite0 phenomenon34)
   goals met: 4 of 16
14. (take_image satellite0 phenomenon34 instrument1 infrared3)
   added: (have_image phenomenon34 infrared3)
   goals met: 5 of 16
15. (turn_to satellite0 phenomenon38 phenomenon34)
   deleted: (pointing satellite0 phenomenon34)
   added: (pointing satellite0 phenomenon38)
   goals met: 5 of 16
16. (take_image satellite0 phenomenon38 instrument1 infrared3)
   added: (have_image phenomenon38 infrared3)
   goals met: 6 of 16
17. (turn_to satellite0 planet27 phenomenon38)
   deleted: (pointing satellite0 phenomenon38)
   added: (pointing satellite0 planet27)
   goals met: 6 of 16
18. (take_image satellite0 planet27 instrument1 infrared1)
   added: (have_image planet27 infrared1)
   goals met: 7 of 16
19. (turn_to satellite0 planet30 planet27)
   deleted: (pointing satellite0 planet27)
   added: (pointing satellite0 planet30)
   goals met: 7 of 16
20. (take_image satellite0 planet30 instrument1 thermograph2)
   added: (have_image planet30 thermograph2)
   goals met: 8 of 16
21. (turn_to satellite0 planet33 planet30)
   deleted: (pointing satellite0 planet30)
   added: (pointing satellite0 planet33)
   goals met: 8 of 16
22. (take_image satellite0 planet33 instrument1 infrared3)
   added: (have_image planet33 infrared3)
   goals met: 9 of 16
23. (turn_to satellite0 planet35 planet33)
   deleted: (pointing satellite0 planet33)
   added: (pointing satellite0 planet35)
   goals met: 9 of 16
24. (take_image satellite0 planet35 instrument1 infrared3)
   added: (have_image planet35 infrared3)
   goals met: 10 of 16
25. (turn_to satellite0 star26 planet35)
   deleted: (pointing satellite0 planet35)
   added: (pointing satellite0 star26)
   goals met: 10 of 16
26. (take_image satellite0 star26 instrument1 infrared3)
   added: (have_image star26 infrared3)
   goals met: 11 of 16
27. (turn_to satellite0 star28 star26)
   deleted: (pointing satellite0 star26)
   added: (pointing satellite0 star28)
   goals met: 11 of 16
28. (take_image satellite0 star28 instrument1 infrared3)
   added: (have_image star28 infrared3)
   goals met: 12 of 16
29. (turn_to satellite0 star37 star28)
   deleted: (pointing satellite0 star28)
   added: (pointing satellite0 star37)
   goals met: 12 of 16
30. (take_image satellite0 star37 instrument1 thermograph2)
   added: (have_image star37 thermograph2)
   goals met: 13 of 16
31. (turn_to satellite0 star39 star37)
   deleted: (pointing satellite0 star37)
   added: (pointing satellite0 star39)
   goals met: 13 of 16
32. (take_image satellite0 star39 instrument1 infrared3)
   added: (have_image star39 infrared3)
   goals met: 14 of 16
33. (turn_to satellite1 star5 phenomenon32)
   deleted: (pointing satellite1 phenomenon32)
   added: (pointing satellite1 star5)
   goals met: 14 of 16
34. (calibrate satellite1 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 14 of 16
35. (turn_to satellite1 phenomenon32 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon32)
   goals met: 14 of 16
36. (take_image satellite1 phenomenon32 instrument2 image0)
   added: (have_image phenomenon32 image0)
   goals met: 15 of 16
37. (turn_to satellite1 planet36 phenomenon32)
   deleted: (pointing satellite1 phenomenon32)
   added: (pointing satellite1 planet36)
   goals met: 15 of 16
38. (take_image satellite1 planet36 instrument2 image0)
   added: (have_image planet36 image0)
   goals met: 16 of 16
